'''Напишите функцию fib(n), которая по данному целому неотрицательному
n возвращает n-e число Фибоначчи.В этой задаче нельзя использовать
циклы — используйте рекурсию.

Например:
6, ответ 8
4, ответ 3
8, ответ 21
'''



def fib(n):
    if n == 1 or n == 2:
        return 1
    else:
        return fib(n - 1) + fib(n - 2)
 
print(fib(int(input())))
