''' Дан список целых чисел, число k и значение C. Необходимо вставить в список
на позицию с индексом k элемент, равный C, сдвинув все элементы, имевшие индекс
не менее k, вправо. Поскольку при этом количество элементов в списке
увеличивается, после считывания списка в его конец нужно будет добавить новый
элемент, используя метод append.

Вставку необходимо осуществлять уже в считанном списке, не делая этого
при выводе и не создавая дополнительного списка.
Например:
1 3 5 7 9 11 13 15 17 19
10 179

4 6 2 4 3 5 12 24 3 5
4 22

4 6 2 4 3 5 12 24 3 5
9 1
'''


l = [int(s) for s in input().split()]
a = [int(s) for s in input().split()]
b = len(l)

for i in range(0,b):
    if i == a[0]:
        l.append(a[1])
        l = l[:i+1]+l[i:b]
        l[i] = a[1]
        break
    elif a[0] == len(l):
        l.append(a[1])
       
print(' '.join([str(i) for i in l]))

'''
a = [int(s) for s in input().split()]
 
# обратите внимание на множественное присваивание:
# справа от "=" стоит список из двух элементов,
# а слева -- две переменные,
# поэтому так делать можно
k, C = [int(s) for s in input().split()]
 
a.append(0)
for i in range(len(a) - 1, k, -1):
    a[i] = a[i - 1]
a[k] = C
print(' '.join([str(i) for i in a]))
'''

