''' Дан список. Выведите те его элементы, которые встречаются в списке
только один раз.Элементы нужно выводить в том порядке, в котором они
встречаются в списке.

1 2 2 3 3 3 (ответ 1)

4 3 5 2 5 1 3 5 (ответ 4 2 1)

6 9 6 23 12 19 14 26 (ответ 9 23 12 19 14 26)

21 21 16 20 28 28 7 (ответ 16 20 7)
'''


l = [int(s) for s in input().split()]
c = []
for i in range(0,len(l)):
    b = l.count(l[i])
    if b == 1:
        c.append(l[i])
    
print(' '.join([str(i) for i in c]))
