'''Выведите все элементы списка с
четными индексами (то есть A[0], A[2], A[4], ...).'''

s = input() 
a = s.split()  
for elem in a[::2]:
    print(elem, end=' ')
